In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@localhost/first

In [2]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost/first
2 rows affected.

[('employee',), ('employees',)]

In [6]:
%%sql
select * from employee;

 * mysql+pymysql://root:***@localhost/first
0 rows affected.

[]

In [21]:
%%sql

insert into employee (id,name,qualification,salary,hire_date) 
values
(3,'BBB','Engineer',45000,'2025-04-12');

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [11]:
%%sql
update employee 
set salary=50000
where id=1;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [16]:
%sql delete from employee where id=2;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [23]:
%%sql
select * from employee where salary>=45000;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[(1, 'AAA', 'Engineer', Decimal('50000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12))]

In [25]:
%%sql
select * from employee order by salary;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[(3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (1, 'AAA', 'Engineer', Decimal('50000.00'), datetime.date(2025, 4, 12))]

In [26]:
%%sql
select * from employee order by salary desc;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[(1, 'AAA', 'Engineer', Decimal('50000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12))]

In [28]:
%%sql

select * from employee where name like '%B';

 * mysql+pymysql://root:***@localhost/first
2 rows affected.

[(3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12))]

In [48]:
%%sql

update employee
set id=3
where name='BBB' 
limit 1;

 * mysql+pymysql://root:***@localhost/first
1 rows affected.

[]

In [49]:
%%sql
select * from employee;

 * mysql+pymysql://root:***@localhost/first
3 rows affected.

[(1, 'AAA', 'Engineer', Decimal('50000.00'), datetime.date(2025, 4, 12)),
 (3, 'BBB', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12)),
 (2, 'CCC', 'Engineer', Decimal('45000.00'), datetime.date(2025, 4, 12))]